app/controllers/inquiries_controller.rb

  def create
    inquiry = params[:inquiry]
    questions = inquiry[:questions]
    inquiry.delete( :questions )
    if new_inquiry = @current_user.inquiries.create( inquiry )
---
INSERT INTO "inquiries" ("created_at", "title", "updated_at", "user_id", "access", "status") VALUES('2010-04-02 22:56:50', 'Yo, this is cool!', '2010-04-02 22:56:50', 1, NULL, NULL)